#+title: Personal Website
#+author: David Álvarez Rosa
#+startup: logdone
#+filetags: :pers:blog:
#+CATEGORY: Blog

This repository contains the source code of my web:
[[https://david.alvarezrosa.com][https://david.alvarezrosa.com]]

* WAIT [#B] Optimizing a Lock-Free Ring Buffer
:PROPERTIES:
:EXPORT_FILE_NAME: optimizing-a-lock-free-ring-buffer
:END:
:LOGBOOK:
CLOCK: [2026-01-24 Sat 10:47]--[2026-01-24 Sat 11:35] =>  0:48
CLOCK: [2026-01-12 Mon 19:13]--[2026-01-21 Wed 19:32] => 216:19
:END:

A single-producer single-consumer (SPSC) queue is a great example of how
far constraints can take a design.  In this post, you will learn how to
implement a ring buffer from scratch: start with the simplest design,
make it thread-safe, and then gradually remove overhead while preserving
FIFO behavior and predictable latency.  This pattern is widely used to
share data between threads in the lowest-latency environments.

* TODO [#B] Deriving Type Erasure
:PROPERTIES:
:EXPORT_FILE_NAME: type-erasure
:END:
:LOGBOOK:
CLOCK: [2026-01-24 Sat 10:47]--[2026-01-24 Sat 10:47] =>  0:00
:END:

Ever looked at ~std::any~ and wondered what’s actually going on behind
the scenes?  Beneath the intimidating interface is a clean case of type
erasure: concrete types hidden behind a small, uniform wrapper.

Starting from familiar tools---virtual functions and templates---we’ll
build a minimal ~std::any~.  Along the way, type erasure shifts from
buzzword to practical technique you can recognize and reuse in your own
designs.

* TODO [#B] About this Website
:PROPERTIES:
:EXPORT_FILE_NAME: about-this-website
:END:
:LOGBOOK:
CLOCK: [2026-01-24 Sat 10:47]--[2026-01-24 Sat 10:47] =>  0:00
:END:

Pending.

